# Getting and Knowing Data

In [3]:
import pandas as pd
import numpy as np

## Step 1 :  Import Data

In [5]:
df = pd.read_csv("chipotle.tsv", sep = "\t")

In [8]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## Step 2 : Dataset Overview

In [9]:
df.shape

(4622, 5)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [11]:
# print all columns 'name'
list(df.columns)

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [12]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [14]:
df. describe(include = "all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

## loc & iloc

In [25]:
df.loc[(df.quantity >= 2) & (df.item_name == "Chicken Bowl"), ['order_id','quantity','item_name']]

      order_id  quantity     item_name
4            2         2  Chicken Bowl
154         70         2  Chicken Bowl
282        124         2  Chicken Bowl
409        178         3  Chicken Bowl
415        181         2  Chicken Bowl
654        271         2  Chicken Bowl
976        401         2  Chicken Bowl
1017       418         2  Chicken Bowl
1106       457         2  Chicken Bowl
1429       578         2  Chicken Bowl
1514       616         3  Chicken Bowl
1588       643         2  Chicken Bowl
1832       741         2  Chicken Bowl
2075       837         2  Chicken Bowl
2106       848         2  Chicken Bowl
2339       932         2  Chicken Bowl
2510       997         2  Chicken Bowl
2525      1004         2  Chicken Bowl
2580      1023         2  Chicken Bowl
2771      1100         2  Chicken Bowl
2942      1170         2  Chicken Bowl
3080      1227         2  Chicken Bowl
3133      1249         2  Chicken Bowl
3151      1257         2  Chicken Bowl
3423      1374         2  Chicken Bowl
3508      1410         2  Chicken Bowl
3612      1447         2  Chicken Bowl
3618      1449         2  Chicken Bowl
3663      1465         2  Chicken Bowl
3843      1540         2  Chicken Bowl
3976      1593         2  Chicken Bowl
4423      1764         2  Chicken Bowl
4435      1767         2  Chicken Bowl

In [32]:
df.iloc[[9]]

,order_id,quantity,item_name,choice_description,item_price
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [34]:
df.iloc[3:11]

,order_id,quantity,item_name,choice_description,item_price
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25
10,5,1,Chips and Guacamole,NaN,$4.45

In [37]:
df.iloc[3:6, :-1]
df.iloc[3:6, -1]

3     $2.39
4    $16.98
5    $10.98
Name: item_price, dtype: object

## Data Manipulation

In [39]:
df.item_price.dtype

dtype('O')

## Apply

In [14]:
df.item_price=df.item_price.apply(lambda x: float(x.replace('$', "")))

In [15]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [16]:
df["total_price"] = df["quantity"] * df["item_price"]

In [48]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

## How much was the revenue for the period in the dataset?

In [17]:
revenue = df["total_price"].sum()
print(revenue)

39237.02

## Which was the most_ordered item?

# Group by

In [68]:
best = df.groupby("item_name")["quantity"].sum()
best.sort_values(ascending = False).head(5)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

In [75]:
#Unique Value
df.item_name.value_counts().count()

50

In [6]:
df.item_name.nunique()

50

## Redo

In [19]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

In [45]:
item_best = df.groupby("item_name")["item_price"].sum()
item_best.sort_values(ascending = False).head(5)

item_name
Chicken Bowl           7342.73
Chicken Burrito        5575.82
Steak Burrito          3851.43
Steak Bowl             2260.19
Chips and Guacamole    2201.04
Name: item_price, dtype: float64

In [47]:
item_best = df.groupby("item_name")["total_price"].sum()
item_best.sort_values(ascending = False).head(5)

item_name
Chicken Bowl           8044.63
Chicken Burrito        6387.06
Steak Burrito          4236.13
Steak Bowl             2479.81
Chips and Guacamole    2475.62
Name: total_price, dtype: float64

## Redo 02

In [50]:
item_best = df.groupby("item_name")["total_price"].sum().sort_values(ascending = False).head(1)
print(item_best)

item_name
Chicken Bowl    8044.63
Name: total_price, dtype: float64